# Tratamento de dados Faltantes

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv("dados/aluguel_residencial.csv", sep=";")

In [3]:
dados

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
22575,32953,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
22576,32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
22577,32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
22578,32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
22579,32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [4]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  22580 non-null  int64
 1   Tipo        22580 non-null  object
 2   Bairro      22580 non-null  object
 3   Quartos     22580 non-null  int64
 4   Vagas       22580 non-null  int64
 5   Suites      22580 non-null  int64
 6   Area        22580 non-null  int64
 7   Valor       22571 non-null  float64
 8   Condominio  20765 non-null  float64
 9   IPTU        15795 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 1.7+ MB

In [5]:
dados[dados["Valor"].isnull()]

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
58,76,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
1492,2186,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
1683,2456,Casa,Campo Grande,3,4,3,363,NaN,NaN,NaN
2012,2941,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
2034,2973,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
4941,7302,Casa,Campo Grande,3,2,1,100,NaN,NaN,NaN
8568,12683,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
8947,13229,Apartamento,Glória,3,0,1,135,NaN,910.0,228.0
9149,13525,Apartamento,Gávea,3,1,1,105,NaN,880.0,221.0

In [6]:
A = dados.shape[0]
dados.dropna(subset=["Valor"], inplace=True)
B = dados.shape[0]
A - B

9